1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		// Для предопределенных элементов многопоточного конвейера уберем возможность редактирования реквизитов
		Элементы.ОбработчикПакета.Доступность = Ложь;
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ИмяДляРазработчика.ТолькоПросмотр = Истина;
		Элементы.ИмяФункции.ТолькоПросмотр = Истина;
		Элементы.ЗаполнитьИмяДляРазработчика.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьПроизвольныйКодОбработки Тогда
		ОбработчикПакета = 1;
	Иначе
		ОбработчикПакета = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ПроизвольныйКодОбработки) Тогда
		// Новый элемент справочника с пустым примером произвольного кода
		ЗагрузитьТекстПроизвольногоКодаИзШаблона("ПроизвольныйКодПоУмолчанию");
	КонецЕсли;
	
	ИнициализацияРедактора();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Перем ЗначениеСвойства;
	
	Если Не ТекущийОбъект.ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ТекущийОбъект.ИмяДляРазработчика) Тогда
			ТекущийОбъект.ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(ТекущийОбъект.Наименование, ТекущийОбъект.Ссылка);
		Иначе
			ум_ПакетыДанныхОбщегоНазначения.ПроверитьУникальностьИмяДляРазработчика(ТекущийОбъект.ИмяДляРазработчика, ТекущийОбъект.Ссылка, Отказ);
		КонецЕсли;
		
		Если ПараметрыЗаписи.Свойство("ПосчитатьХешПроизвольногоКода", ЗначениеСвойства) И ЗначениеСвойства Тогда
			ПосчитатьХешПроизвольногоКода();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(РедакторHTML) Тогда
		ДокументHTML = Элементы.РедакторHTML.Документ;
		Если Не Объект.ПроизвольныйКодОбработки = ДокументHTML.getElementById("code").value Тогда
			Объект.ПроизвольныйКодОбработки = ДокументHTML.getElementById("code").value;
			ПараметрыЗаписи.Вставить("ПосчитатьХешПроизвольногоКода", Истина)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УдалятьПакетПриУспешнойОбработкеПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры // УдалятьПакетПриУспешнойОбработкеПриИзменении()

&НаКлиенте
Процедура ОбработчикПакетаПриИзменении(Элемент)
	
	Если ОбработчикПакета = 0 Тогда
		Объект.ИспользоватьПроизвольныйКодОбработки = Ложь;
	Иначе
		Объект.ИспользоватьПроизвольныйКодОбработки = Истина;
	КонецЕсли;
	
	ПосчитатьХешПроизвольногоКода();
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры // ОбработчикПакетаПриИзменении()

&НаКлиенте
Процедура ИспользоватьОбщийСписокОшибокПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры // ИспользоватьОбщийСписокОшибокПриИзменении()

&НаКлиенте
Процедура Декорация30Нажатие(Элемент)
	
	ПолучитьФорму("Справочник.ум_ОписанияОшибокОбработкиПакетов.ФормаСписка",, ЭтаФорма).Открыть();
	
КонецПроцедуры // Декорация30Нажатие()

&НаКлиенте
Процедура НаправлятьНаПовторнуюОбработкуПакетыСОшибкамиБлокировкиПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры // НаправлятьНаПовторнуюОбработкуПакетыСОшибкамиБлокировкиПриИзменении()

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИнициализацияРедактора();
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторHTMLДокументСформирован(Элемент)
	
	ПроизвольныйКодВДокументРедактораHTML()
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроизвольныйКодПоУмолчанию(Команда)
	
	КомандаЗагрузитьПроизвольныйКодИзШаблона("ПроизвольныйКодПоУмолчанию");
	
КонецПроцедуры // ОчиститьПроизвольныйКод()

&НаКлиенте
Процедура ЗаполнитьИмяДляРазработчика(Команда)
	
	ЗаполнитьИмяДляРазработчикаНаСервере();
	
КонецПроцедуры // ЗаполнитьИмяДляРазработчика()

&НаКлиенте
Процедура КомандаЗапускУправляющегоФЗ(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускУправляющегоФЗ_Продолжение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Запустить фоновое задание обработки пакетов по способу - """ + Объект.Ссылка + """", РежимДиалогаВопрос.ДаНетОтмена, 60);
	
КонецПроцедуры // КомандаЗапускУправляющегоФЗ()


&НаКлиенте
Процедура ПроизвольныйКодЗаписьОбъектов(Команда)
	
	КомандаЗагрузитьПроизвольныйКодИзШаблона("ПроизвольныйКодЗаписьОбъектов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйКодПроведениеДокументов(Команда)
	КомандаЗагрузитьПроизвольныйКодИзШаблона("ПроизвольныйКодПроведениеДокументов");
КонецПроцедуры // ПроизвольныйКодПроведениеДокументов()

&НаКлиенте
Процедура ПроизвольныйКодНепосредственноеУдалениеОбъектов(Команда)
	КомандаЗагрузитьПроизвольныйКодИзШаблона("ПроизвольныйКодНепосредственноеУдалениеОбъектов");
КонецПроцедуры // ПроизвольныйКодНепосредственноеУдалениеОбъектов()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПосчитатьХешПроизвольногоКода()
	
	Если Объект.ИспользоватьПроизвольныйКодОбработки И ЗначениеЗаполнено(Объект.ПроизвольныйКодОбработки) Тогда 
		Объект.ХешСуммаПроизвольногоКодаОбработки = ум_ПакетыДанныхОбщегоНазначения.ХешФункцияПроизвольногоКода(Объект.ПроизвольныйКодОбработки);
	Иначе
		Объект.ХешСуммаПроизвольногоКодаОбработки = "";
	КонецЕсли;
	
КонецПроцедуры // ПосчитатьХешПроизвольногоКода()

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()  
	
	Элементы.ГруппаТаймаутУдаленияПакета.Доступность = Объект.УдалятьПакетПриУспешнойОбработке;
	
	Если Объект.ПовторнаяОбработкаПакетовСОшибками Тогда
		Элементы.ИспользоватьОбщийСписокОшибок.Доступность	= Истина;
		Элементы.ДекорацияОбщийСписокОшибок.Доступность		= Объект.ИспользоватьОбщийСписокОшибок;
		Элементы.ОшибкиОбработкиПакетов.Доступность			= Истина;
	Иначе
		Элементы.ИспользоватьОбщийСписокОшибок.Доступность	= Ложь;
		Элементы.ДекорацияОбщийСписокОшибок.Доступность		= Ложь;
		Элементы.ОшибкиОбработкиПакетов.Доступность			= Ложь;
		
	КонецЕсли;
	
	Если Объект.ИспользоватьПроизвольныйКодОбработки Тогда
		Элементы.СтраницаПроизвольныйКод.Доступность = Истина;
		Элементы.ИмяФункции.Видимость = Ложь;
	Иначе
		Элементы.СтраницаПроизвольныйКод.Доступность = Ложь;
		Элементы.ИмяФункции.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УправлениеВидимостьюДоступностью()

&НаКлиенте
Процедура ЗапускУправляющегоФЗ_Продолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗапускУправляющегоФЗСервер();
	КонецЕсли;
	
КонецПроцедуры // ЗапускУправляющегоФЗ_Продолжение()

&НаСервере
Процедура ЗапускУправляющегоФЗСервер() Экспорт
	
	ум_ПакетыДанныхОбработка.ОбработатьПакетыДанных(Объект.Ссылка)
	
КонецПроцедуры // ЗапускУправляющегоФЗСервер()

&НаСервере
Процедура ЗагрузитьТекстПроизвольногоКодаИзШаблона(ИмяШаблона)
	
	ТекстовыйДокумент = Справочники.ум_СпособыОбработкиПакетов.ПолучитьМакет(ИмяШаблона);
	Объект.ПроизвольныйКодОбработки = ТекстовыйДокумент.ПолучитьТекст();
	ПосчитатьХешПроизвольногоКода();
	
КонецПроцедуры // УстановитьТекстПримераПроизвольногокода()

&НаСервере
Процедура ЗаполнитьИмяДляРазработчикаНаСервере()
	
	Объект.ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(Объект.Наименование, Объект.Ссылка);
	
КонецПроцедуры // ЗаполнитьИмяДляРазработчикаНаСервере()

&НаСервере
Процедура ИнициализацияРедактора()
	
	РедакторHTMLИнициализзирован = ЗначениеЗаполнено(РедакторHTML);
	ЭтоСтраницаПроизвольныйКод = Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйКод;
	Если Не РедакторHTMLИнициализзирован И ЭтоСтраницаПроизвольныйКод Тогда
		ТекстовыйДокумент = Справочники.ум_СпособыОбработкиПакетов.ПолучитьМакет("РедакторHTML");
		РедакторHTML = ТекстовыйДокумент.ПолучитьТекст();
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияРедактора()

&НаКлиенте
Процедура ПроизвольныйКодВДокументРедактораHTML()
	
	Если ЗначениеЗаполнено(РедакторHTML) Тогда
		ДокументHTML = Элементы.РедакторHTML.Документ;
		ДокументHTML.getElementById("code").value = Объект.ПроизвольныйКодОбработки;
		ДокументHTML.render();
	КонецЕсли;
	
КонецПроцедуры // ПроизвольныйКодВДокументРедактораHTML()

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗагрузитьКодИзШаблона(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗгрузитьПроизвольныйКодИзНаблона(ДополнительныеПараметры.ИмяШаблона);
	
КонецПроцедуры // ПослеЗакрытияВопросаЗагрузитьКодИзШаблона()

&НаКлиенте
Процедура КомандаЗагрузитьПроизвольныйКодИзШаблона(ИмяШаблона)
	
	ДокументHTML = Элементы.РедакторHTML.Документ;
	ТекстИзменен = Не Объект.ПроизвольныйКодОбработки = ДокументHTML.getElementById("code").value;
	
	Если ТекстИзменен Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяШаблона", ИмяШаблона);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗагрузитьКодИзШаблона", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Код изменен и будет потерян, продолжить загрузку из шаблона?';");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 0);
	Иначе
		ЗгрузитьПроизвольныйКодИзНаблона(ИмяШаблона);
	КонецЕсли;
	
КонецПроцедуры // КомандаЗагрузитьПроизвольныйКодИзШаблона()

&НаКлиенте
Процедура ЗгрузитьПроизвольныйКодИзНаблона(ИмяШаблона)
	
	ЗагрузитьТекстПроизвольногоКодаИзШаблона(ИмяШаблона);
	ПроизвольныйКодВДокументРедактораHTML();
	
КонецПроцедуры // ЗгрузитьПроизвольныйКодИзНаблона()

#КонецОбласти // СлужебныеПроцедурыИФункции
